from pathlib import Path
from colorama import Fore, init
import sys

init(autoreset=True)
def snake_case(path: Path, prefix = "    "):
    """
    Рекурсивно виводить структуру директорій та файлів у вигляді дерева з кольорами та emoji.

    Аргументи:
    ----------
    path : Path
        Об'єкт Path, що вказує на поточну директорію для виведення.
    prefix : str, optional
        Строка-префікс, що додається перед назвою кожного елемента
        для формування відступів та ліній дерева.
        Використовується для правильного відображення гілок при рекурсивному обході піддиректорій. За замовчуванням "    ".
    """
    # Перевірка, чи існує шлях
    if not path.exists():
        print(f'{Fore.RED} Помилка : Файлу не існує')
        sys.exit(1)



    # Отримуємо список усіх елементів директорії та сортуємо: спочатку папки, потім файли
    items = sorted(path.iterdir(), key=lambda x: (x.is_file(), x.name))
    
    # Проходимо по кожному елементу директорії
    for i, item in enumerate(items):
        # Визначаємо символ з'єднувача: '┗' для останнього елемента, '┣' для інших
        connector = "┗" if i == len(items)-1 else '┣'

        # Якщо елемент — папка
        if item.is_dir():
            # Виводимо назву папки синім кольором та emoji 📂
            print(f'{prefix}{connector}📂{Fore.BLUE}{item.name}/')
            # Формуємо новий префікс для рекурсивного виклику
            # Якщо поточний елемент останній, лінії вниз не продовжуємо ('    '), інакше додаємо '┃    '
            new_prefix = prefix + ('    ' if i == len(items)-1 else '┃    ')
            # Рекурсивно викликаємо функцію для піддиректорії
            snake_case(item, new_prefix)

        # Якщо елемент — файл
        if item.is_file():
            # Виводимо назву файлу зеленим кольором та emoji 📜
            print(f'{prefix}{connector}📜{Fore.GREEN}{item.name}')

# Перевірка на наявність аргументу командного рядка
if len(sys.argv) != 2:
    print(f'{Fore.RED} Помилка : не вказано шлях до директорії')


# Отримуємо шлях до директорії з аргументів командного рядка
path_to_dir = sys.argv[1]
# Перетворюємо шлях на об'єкт Path та отримуємо абсолютний шлях
path = Path(path_to_dir).resolve()

# Перевірка, чи є шлях директорією
if not path.is_dir():
    print(f'{Fore.RED} Помилка : Файл не є директорією')
# Виводимо кореневу папку червоним кольором та emoji 📦
print(f'📦{Fore.RED}{path.name}/')

# Викликаємо рекурсивну функцію для виведення всіх елементів всередині кореня
snake_case(path)
